import React from "react";
import mitropolit from "../../../../mitropolit.png";
import Bishop from "./components/Bishop.css";

class BishopContainer extends React.Component {
  constructor(props) {
    super(props);

    this.state = {};
  }

  render() {
    return (
        <div className="component">
          <div className="container">
            <div className="row">
              <div className="col-sm">
                <img src={mitropolit} className="imageBishop" alt="mitropolit" />
              </div>
              <div className="col-sm">
                <div className="discription">
                  <text>
                    Антоний е български православен духовник, константийски епископ
                    от 2008 до 2013 година и западно и средноевропейски митрополит
                    от 2013 година на Българската православна църква.
                  </text>
                </div>
              </div>
              <div className='text'>
                <div className="m-3">
                  <text>
                    {" "}
                    Роден на 17 януари 1978 г. в Стара Загора, България, със
                    светското име Живко Киров Михалев в семейството на изселници от
                    тракийския град Гюмюрджина. Завършва основно образование в Стара
                    Загора. От 1993 до 1998 година учи в Пловдивската духовна
                    семинария „Св. св. Кирил и Методий“, която завърщва с отличен
                    успех и продължава образованието си в Богословския факултет на
                    Софийския университет „Свети Климент Охридски“.
                  </text>
                </div>
                <div className="m-3">
                  <text>
                    Докато е студент пее в църквата „Успение Богородично“ в
                    Малашевци. През пролетта на 2002 г. постъпва като послушник в
                    Клисурския манастир, където е постриган за монах на 5 август
                    2002 г. под духовното наставничество на архимандрит Сионий,
                    ректор на Софийската духовна семинария. Ръкоположен е за
                    йеродякон на 18 октомври 2002 г. и за йеромонах на 17 януари
                    2003 г. от митрополит Дометиан Видински.
                  </text>
                </div>
                <div className="m-3">
                  {" "}
                  <text>
                    След завърщването на академията, е назначен за ефимерий и
                    преподавател в Пловдивската семинария под ръководството на
                    ректора епископ Евлогий Адрианополски. По негово предложение на
                    21 ноември 2006 г. е отличен с офикията архимандрит от
                    митрополит Неофит Русенски.
                  </text>
                </div>
                <div className="m-3">
                  {" "}
                  <tex>
                    По искане на митрополит Николай от 1 май 2007 г. е назначен за
                    протосингел на Пловдивската митрополия. По предложение на
                    митрополит Николай Пловдивски на 23 март 2008 г. е ръкоположен
                    за константинийски епископ в пловдивския храм „Света Марина“ и е
                    назначен за негов викарий в град Смолян. 1 юли 2009 года е
                    назначен за ректор на Пловдивска духовна семинария на мястото на
                    архимандрит Сергий Шапков.
                  </tex>
                </div>

                <div className="m-3">
                  {" "}
                  <tex>
                    От юни 2010 г. е назначен за викарий на митрополит Симеон
                    Западно и Средноевропейски. Остава на поста и при управляващия
                    епархията митрополит Григорий Великотърновски, след приемането
                    на оставката на митрополит Симеон през юни 2013 г. На 27
                    октомври 2013 г. е избран за митрополит на Западно- и
                    Средоевропейската епархия на Българската православна църква
                  </tex>
                </div>
              </div>
            </div>
          </div>
        </div>

    );
  }
}

BishopContainer.propTypes = {};

export default BishopContainer;
